function [y] = Channel_Nonlinear_Volterra(s)

%说明：将信号输入到非线性Volterra信道，得到输出信号
%输入：s为原始信号
%输出：y为经过信道后的输出信号

len = length(s);
y = zeros(1,len);
order=3;           %Volterra信道阶数
%     h1=[1.22+0.646j 0.063-0.001j -0.024-0.014j 0.036-0.031j];%一阶核系数
%     h3=[0.039-0.022j 0.018-0.018j 0.035-0.035j -0.040-0.009j -0.01-0.017j];%三阶核系数
h1=[0.8529+0.4502i 0.0881-0.0014i -0.0336-0.0196i 0.0503+0.0433i];                %第二种核系数
h3=[0.0979-0.0979i 0.1091-0.0615i -0.1119-0.0252i -0.028-0.0475i 0.0503-0.0503i]; %第二种核系数
%构建三阶volterra信道
for n=(order+1):len
    s1=[s(n);s(n-1);s(n-2);s(n-3)];       %一阶级数
    s002=s(n)*s(n)*conj(s(n-2));  s330=s(n-3)*s(n-3)*conj(s(n));  s001=s(n)*s(n)*conj(s(n-1));
    s003=s(n)*s(n)*conj(s(n-3));  s110=s(n-1)*s(n-1)*conj(s(n));

    s3=[s001;s002;s003;s110;s330];       %三阶核系数
    y(n)=h1*s1+h3*s3;                    %经过Volterra信道后
end